Documents/МаркировкаТоваровГИСМ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>МаркировкаТоваровГИСМ</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ТоварыВРезервеНаСкладах</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидПродукции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТоварныеГруппыЧЗ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьРасхождения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кладовщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособВводаВОборот</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособВводаВОборот</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособИзготовления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСервисПровайдеровСУЗ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыМаркировкиТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШтампВерсии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>GTIN</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>14</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоФакт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоИзлишки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Заказано</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ячейка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Ячейки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подборка</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ПодборкаНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Факт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСтроки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/ТоварыВЯчейках.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыВЯчейках</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПроблемнаяЯчейка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Ячейки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ячейка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Ячейки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГМ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/СпособВводаВОборот.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СпособВводаВОборот</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>МаркировкаОстатков</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перемаркировка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОтПокупателя</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СтатусыМаркировкиТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыМаркировкиТоваров</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Черновик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перемещение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаказНаЭмиссию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Нанесение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтчетОНанесении</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВводВОборот</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Завершен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ошибка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ЗаказНаЭмиссиюКодовМаркировкиСУЗ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЗаказНаЭмиссиюКодовМаркировкиСУЗ</Name>
			<BasedOn>
				<xr:Item>Document.МаркировкаТоваровГИСМ</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаказаНаМаркировку</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПродукции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТоварныеГруппыЧЗ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.МаркировкаТоваровГИСМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособИзготовления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСервисПровайдеровСУЗ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособВводаВОборот</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособВводаВОборот</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШтампВерсии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>GTIN</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>14</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Эмитировано</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/МаркировкаТоваровГИСМ/Ext/ManagerModule.bsl
Процедура ПечатьЯчейки(ДокСсылка , ШтрихКод , ИмяПринтера, СразуНаПринтер = Ложь, ВернутьТабДок = Неопределено) Экспорт
	
	Макет = ПолучитьМакет("ЯчейкиГУИД_Мини");
	ИмяМакета = "ЯчейкиГУИД_Мини";        
	
	ТабДок  = Новый ТабличныйДокумент;
	ОбластьМакета                  = Макет.ПолучитьОбласть("Шапка");
	ОбластьМакета.Параметры.Номер  = ДокСсылка.Номер;
	ОбластьМакета.Параметры.Дата   = Формат(ДокСсылка.Дата, "ДЛФ=D"); 
	
	ОбластьМакета.Параметры.Клиент = "Честный знак";
	
	ШтрихкодированиеПечатныхФорм.ВывестиШтрихкодВТабличныйДокумент(ТабДок, Макет, ОбластьМакета, ДокСсылка);
	
	ТабДок.Вывести(ОбластьМакета);
	
	СКорректировкой = Истина;
	
	Запрос = Новый Запрос;
	
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Константы.ОсновнойСклад
	|ПОМЕСТИТЬ ВТ_ОсновнойСклад
	|ИЗ
	|	Константы КАК Константы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МаркировкаТоваровГИСМЗаказано.НомерСтроки,
	|	МаркировкаТоваровГИСМЗаказано.Номенклатура,
	|	МаркировкаТоваровГИСМЗаказано.Количество,
	|	МаркировкаТоваровГИСМЗаказано.Ячейка
	|ПОМЕСТИТЬ ВТ_ТоварыВМаркировке
	|ИЗ
	|	Документ.МаркировкаТоваровГИСМ.Заказано КАК МаркировкаТоваровГИСМЗаказано
	|ГДЕ
	|	МаркировкаТоваровГИСМЗаказано.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	МаркировкаТоваровГИСМЗаказано.Ссылка,
	|	МаркировкаТоваровГИСМЗаказано.НомерСтроки,
	|	МаркировкаТоваровГИСМЗаказано.Номенклатура,
	|	МаркировкаТоваровГИСМЗаказано.Количество,
	|	МаркировкаТоваровГИСМЗаказано.Ячейка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыВЯчейкахОстатки.Номенклатура,
	|	ТоварыВЯчейкахОстатки.Ячейка,
	|	СУММА(ТоварыВЯчейкахОстатки.КоличествоОстаток) КАК КоличествоОстаток
	|ПОМЕСТИТЬ ВТ_ОстаткиВЯчейках
	|ИЗ
	|	РегистрНакопления.ТоварыВЯчейках.Остатки(
	|			,
	|			(Номенклатура, Ячейка) В
	|					(ВЫБРАТЬ
	|						ВТ_ТоварыВМаркировке.Номенклатура,
	|						ВТ_ТоварыВМаркировке.Ячейка
	|					ИЗ
	|						ВТ_ТоварыВМаркировке)
	|				И Склад В
	|					(ВЫБРАТЬ
	|						ВТ_ОсновнойСклад.ОсновнойСклад
	|					ИЗ
	|						ВТ_ОсновнойСклад)) КАК ТоварыВЯчейкахОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыВЯчейкахОстатки.Номенклатура,
	|	ТоварыВЯчейкахОстатки.Ячейка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТоварыВМаркировке.Номенклатура.Родитель КАК Папа,
	|	ВТ_ТоварыВМаркировке.Номенклатура,
	|	ВТ_ТоварыВМаркировке.Номенклатура.КодПроизводителя КАК КодПроизводителя,
	|	ВТ_ТоварыВМаркировке.Ячейка,
	|	ВТ_ТоварыВМаркировке.Количество,
	|	ЕСТЬNULL(ВТ_ОстаткиВЯчейках.КоличествоОстаток, 0) КАК ОстатокВЯчейке
	|ИЗ
	|	ВТ_ТоварыВМаркировке КАК ВТ_ТоварыВМаркировке
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОстаткиВЯчейках КАК ВТ_ОстаткиВЯчейках
	|		ПО ВТ_ТоварыВМаркировке.Номенклатура = ВТ_ОстаткиВЯчейках.Номенклатура
	|			И ВТ_ТоварыВМаркировке.Ячейка = ВТ_ОстаткиВЯчейках.Ячейка";   
	
	Запрос.УстановитьПараметр("Ссылка", ДокСсылка);
	
	ТаблицаДляПечати = Новый ТаблицаЗначений;
	ТаблицаДляПечати.Колонки.Добавить("Номенклатура");
	ТаблицаДляПечати.Колонки.Добавить("Ячейка");
	ТаблицаДляПечати.Колонки.Добавить("Артикул");
	ТаблицаДляПечати.Колонки.Добавить("ОстатокВЯчейке");
	ТаблицаДляПечати.Колонки.Добавить("Кол");
	ТаблицаДляПечати.Колонки.Добавить("Сч");
	ТаблицаДляПечати.Колонки.Добавить("Папа");
	ТаблицаДляПечати.Колонки.Добавить("ЕдИзм");
	ТаблицаДляПечати.Колонки.Добавить("Примечание");
	ТаблицаДляПечати.Колонки.Добавить("Этаж");
	ТаблицаДляПечати.Колонки.Добавить("Секция");
	ТаблицаДляПечати.Колонки.Добавить("Сектор");
	ТаблицаДляПечати.Колонки.Добавить("КодПроизводителя");  
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	РезультатЗапроса.Свернуть("Номенклатура, Ячейка", "Количество,ОстатокВЯчейке");
	
	Если РезультатЗапроса.Количество() = 0 Тогда  
		
		//+Гавриленков В. 01.08.2025 #UT10-5367
		//Предупреждение("Нет данных для печати",5);
		//-Гавриленков В. 01.08.2025 #UT10-5367
		Возврат;
		
	КонецЕсли;
	
	Для каждого ТекСтр  Из РезультатЗапроса Цикл
		
		НоваяСтрокаДляПечати				  = ТаблицаДляПечати.Добавить();
		НоваяСтрокаДляПечати.Номенклатура	  = ТекСтр.Номенклатура;
		НоваяСтрокаДляПечати.Ячейка			  = ТекСтр.Ячейка;
		НоваяСтрокаДляПечати.Кол			  = ТекСтр.Количество;
		НоваяСтрокаДляПечати.ОстатокВЯчейке	  = ТекСтр.ОстатокВЯчейке;
		НоваяСтрокаДляПечати.Папа			  = ТекСтр.Номенклатура.Родитель;
		НоваяСтрокаДляПечати.Примечание		  = Лев(ТекСтр.Номенклатура.Комментарий, 28);	
		НоваяСтрокаДляПечати.ЕдИзм			  = ТекСтр.Номенклатура.ЕдиницаХраненияОстатков;
		НоваяСтрокаДляПечати.КодПроизводителя = ТекСтр.Номенклатура.КодПроизводителя;
		НоваяСтрокаДляПечати.Этаж			  = ТекСтр.Ячейка.Этаж ; 
		
	КонецЦикла;
	
	ТаблицаДляПечати.Сортировать("Этаж,Ячейка Убыв");	
	
	Сч = 1;
	
	Если ТаблицаДляПечати.Количество() = 0 Тогда 
		
		//+Гавриленков В. 01.08.2025 #UT10-5367
		//Предупреждение("Нет данных для печати",5);
		//-Гавриленков В. 01.08.2025 #UT10-5367
		Возврат;    
		
	КонецЕсли;
	
	Для Каждого СтрокаДляПечати ИЗ ТаблицаДляПечати Цикл  
		
		ОбластьМакета = Макет.ПолучитьОбласть("Строка");
		ОбластьМакета.Параметры.Заполнить(СтрокаДляПечати);
		ОбластьМакета.Параметры.Сч = Сч;
		ТабДок.Вывести(ОбластьМакета);
		Сч  = Сч +1;
		
	КонецЦикла;
	
	ТабДок.ФиксацияСверху      = 2;
	ТабДок.ОриентацияСтраницы  = ОриентацияСтраницы.Портрет;
	ТабДок.АвтоМасштаб         = Истина;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.ОтображатьСетку     = Ложь;
	ТабДок.ТолькоПросмотр      = Истина;
	
	ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
	ТабДок.Вывести(ОбластьМакета);      
	
	Если ВернутьТабДок = Неопределено Тогда	
		
		Если Не ИмяПринтера = "" Тогда  
			
			ТабДок.ИмяПринтера = ИмяПринтера;
			ТабДок.Напечатать();  
			
		ИначеЕсли СразуНаПринтер Тогда 
			ТабДок.Напечатать();   
		Иначе
			УниверсальныеМеханизмы.НапечататьДокумент(ТабДок, 1, СразуНаПринтер, ОбщегоНазначения.СформироватьЗаголовокДокумента(ДокСсылка), ДокСсылка);
		КонецЕсли;
		
	Иначе          
		ВернутьТабДок = ТабДок;	
	КонецЕсли;	

КонецПроцедуры

Процедура ЗаполнитьКоличествоПлан(ДокОбъект) Экспорт
	
	//+Шульман А. 01.10.2025 #UT10-5445   
	МассивНоменклатуры = ДокОбъект.Товары.ВыгрузитьКолонку("Номенклатура");  
	
	ЗаполнениеИзЯчейкиПеремаркировка = (ЗначениеЗаполнено(ДокОбъект.ДокументОснование) Или ДокОбъект.СпособВводаВОборот = Перечисления.СпособВводаВОборот.Перемаркировка);
	тзОстатки = Маркировка.ПолучитьОстаткиНоменклатурыДляМаркировки(МассивНоменклатуры, ПолучитьУсловиеПоЯчейке(ЗаполнениеИзЯчейкиПеремаркировка));
	
	Для Каждого тзСтрока Из ДокОбъект.Товары Цикл   
		тзСтрока.Количество = 0;
	КонецЦикла;
	
	Если Не ЗначениеЗаполнено(тзОстатки) Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого тзСтрока Из ДокОбъект.Товары Цикл   
		
		тзСтрокаОстатки = тзОстатки.Найти(тзСтрока.Номенклатура, "Номенклатура");
		
		Если Не тзСтрокаОстатки = Неопределено Тогда
			тзСтрока.Количество = тзСтрокаОстатки.СвободныйСРазмещением;
		КонецЕсли;  
		
	КонецЦикла;
	//-Шульман А. 01.10.2025 #UT10-5445
	
КонецПроцедуры

Процедура ВзятьМаркировкуВРаботу(ДокОбъект)Экспорт 
	
	//+Кабанов А.В. 22.07.2025 # UT10-5343 
	
	Если ДокОбъект.Товары.Итог("Количество") = 0 Тогда
		
		//+Гавриленков В. 01.08.2025 #UT10-5367
		//Предупреждение("В ячейках отсутствует товар для маркировки !" , 10 , "ВНИМАНИЕ !"); 
		//-Гавриленков В. 01.08.2025 #UT10-5367
		ДокОбъект.Статус = Перечисления.СтатусыМаркировкиТоваров.Черновик;     
		Возврат;
		
	КонецЕсли;
	
	//+Шульман А. 01.10.2025 #UT10-5445   
	//Для Каждого СтрокаТовары Из МаркировкаСсылка.Товары Цикл                                           	
	//	СтрокаТовары.Количество = МодульПолучитьСвободныйОстаток(СтрокаТовары.Номенклатура);		
	//КонецЦикла;             
	ЗаполнитьКоличествоПлан(ДокОбъект);
	//-Шульман А. 01.10.2025 #UT10-5445   
	
	
	ЗапросОстатковПоЯчейкам = Новый Запрос;
	ЗапросОстатковПоЯчейкам.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	МаркировкаТоваровГИСМТовары.Номенклатура,
	|	СУММА(МаркировкаТоваровГИСМТовары.Количество) КАК Количество
	|ПОМЕСТИТЬ ВТ_ТоварыМаркировки
	|ИЗ
	|	Документ.МаркировкаТоваровГИСМ.Товары КАК МаркировкаТоваровГИСМТовары
	|ГДЕ
	|	МаркировкаТоваровГИСМТовары.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	МаркировкаТоваровГИСМТовары.Номенклатура
	|
	|ИМЕЮЩИЕ
	|	СУММА(МаркировкаТоваровГИСМТовары.Количество) > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыВЯчейкахОстатки.Склад КАК Склад,
	|	ТоварыВЯчейкахОстатки.Номенклатура КАК Номенклатура,
	|	ТоварыВЯчейкахОстатки.Ячейка,
	|	ТоварыВЯчейкахОстатки.Ячейка.Этаж КАК Этаж,
	|	ТоварыВЯчейкахОстатки.Ячейка.ПриоритетСписывания КАК ПриоритетСписывания,
	|	ТоварыВЯчейкахОстатки.КоличествоОстаток КАК Количество
	//|ПОМЕСТИТЬ ОстаткиПоЯчейкам
	|ИЗ
	|	РегистрНакопления.ТоварыВЯчейках.Остатки(
	|			,
	|			Номенклатура В
	|					(ВЫБРАТЬ
	|						ВТ_ТоварыМаркировки.Номенклатура
	|					ИЗ
	|						ВТ_ТоварыМаркировки КАК ВТ_ТоварыМаркировки)
	|				И Склад = &ОсновнойСклад   
	//+Шульман А. 01.10.2025 #UT10-5445
	//|				И Ячейка.Этаж <> 0
	//|				И Ячейка <> &ЯчейкаДоВыяснения
	//|				И Ячейка.НеУчитыватьВОперативномУчете = ЛОЖЬ
	|				И &УсловиеЯчейки) КАК ТоварыВЯчейкахОстатки    
	//-Шульман А. 01.10.2025 #UT10-5445
	|ГДЕ
	|	ТоварыВЯчейкахОстатки.КоличествоОстаток > 0   
	//+Шульман А. 01.10.2025 #UT10-5445
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ОстаткиПоЯчейкам.Склад,
	//|	ОстаткиПоЯчейкам.Этаж КАК Этаж,
	//|	ОстаткиПоЯчейкам.Номенклатура КАК Номенклатура,
	//|	ОстаткиПоЯчейкам.Ячейка,
	//|	ОстаткиПоЯчейкам.ПриоритетСписывания КАК ПриоритетСписывания,
	//|	ОстаткиПоЯчейкам.Количество
	//|ИЗ
	//|	ОстаткиПоЯчейкам КАК ОстаткиПоЯчейкам
	//|ГДЕ
	//|	ОстаткиПоЯчейкам.Склад = &ОсновнойСклад
	//|	И ОстаткиПоЯчейкам.Количество > 0   
	//-Шульман А. 01.10.2025 #UT10-5445
	|
	|УПОРЯДОЧИТЬ ПО
	|	Номенклатура,
	|	ПриоритетСписывания УБЫВ,
	|	Этаж";
	
	ЗапросОстатковПоЯчейкам.УстановитьПараметр("Ссылка", ДокОбъект.Ссылка);
	ЗапросОстатковПоЯчейкам.УстановитьПараметр("ЯчейкаДоВыяснения", Константы.ЯчейкаДоВыяснения.Получить());  
	//+Шульман А. 01.10.2025 #UT10-5445
	ЗапросОстатковПоЯчейкам.УстановитьПараметр("ЯчейкаДляПеремаркировки", Константы.ЯчейкаДляПеремаркировки.Получить());
	ЗапросОстатковПоЯчейкам.УстановитьПараметр("ОсновнойСклад", Константы.ОсновнойСклад.Получить());
	
	ЗаполнениеИзЯчейкиПеремаркировка = (ЗначениеЗаполнено(ДокОбъект.ДокументОснование) Или ДокОбъект.СпособВводаВОборот = Перечисления.СпособВводаВОборот.Перемаркировка);
	
	Если ЗаполнениеИзЯчейкиПеремаркировка Тогда
		ЗапросОстатковПоЯчейкам.Текст = СтрЗаменить(ЗапросОстатковПоЯчейкам.Текст, "&УсловиеЯчейки", "Ячейка = &ЯчейкаДляПеремаркировки");
	Иначе
		ЗапросОстатковПоЯчейкам.Текст = СтрЗаменить(ЗапросОстатковПоЯчейкам.Текст, "&УсловиеЯчейки",
					"Ячейка.Этаж <> 0 И Ячейка <> &ЯчейкаДоВыяснения И Ячейка.НеУчитыватьВОперативномУчете = ЛОЖЬ");
	КонецЕсли;		
	//-Шульман А. 01.10.2025 #UT10-5445
	
	ТЗЯчейки = ЗапросОстатковПоЯчейкам.Выполнить().Выгрузить();
	
	Если ТЗЯчейки.Количество() = 0 Тогда    
		Возврат;
	КонецЕсли;
	
	ДокОбъект.Статус = Перечисления.СтатусыМаркировкиТоваров.Перемещение;
	
	ТЗ_ПерваяОчередь = Новый ТаблицаЗначений;
	ТЗ_ПерваяОчередь.Колонки.Добавить("Склад");
	ТЗ_ПерваяОчередь.Колонки.Добавить("Этаж");
	ТЗ_ПерваяОчередь.Колонки.Добавить("Номенклатура");
	ТЗ_ПерваяОчередь.Колонки.Добавить("Ячейка");
	ТЗ_ПерваяОчередь.Колонки.Добавить("ПриоритетСписывания");
	ТЗ_ПерваяОчередь.Колонки.Добавить("Количество");
	ТЗ_ПерваяОчередь.Колонки.Добавить("ИндексСтроки");
	
	ТЗ_ВтораяОчередь = ТЗ_ПерваяОчередь.Скопировать();
	
	ПромТаблТовары = ДокОбъект.Товары.Выгрузить();
	
	Для Каждого СтрТоваров Из ПромТаблТовары Цикл
		
		СтруктураПоиска = Новый Структура("Номенклатура", стрТоваров.Номенклатура);
		
		ТЗ_ПерваяОчередь.Очистить();
		ТЗ_ВтораяОчередь.Очистить();
		
		НайденныеСтроки = ТЗЯчейки.НайтиСтроки(СтруктураПоиска); 
		
		Для Каждого СтрПоиска Из НайденныеСтроки Цикл
			
			Если СтрПоиска.Количество = 0 Тогда 
				Продолжить;
			КонецЕсли;
			
			Если СтрПоиска.Количество >= СтрТоваров.Количество Тогда 
				
				НоваяСтрокаПоиска = ТЗ_ПерваяОчередь.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрокаПоиска, СтрПоиска);
				
			ИначеЕсли СтрПоиска.Количество < СтрТоваров.Количество И СтрПоиска.Количество > 0 Тогда 
				
				НоваяСтрокаПоиска = ТЗ_ВтораяОчередь.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрокаПоиска, СтрПоиска);
				
			КонецЕсли; 
			
			НоваяСтрокаПоиска.ИндексСтроки = ТЗЯчейки.Индекс(СтрПоиска);
			
		КонецЦикла;
		
		ТЗ_ПерваяОчередь.Сортировать("ПриоритетСписывания,Этаж");
		ТЗ_ВтораяОчередь.Сортировать("ПриоритетСписывания,Этаж");
		
		Для Каждого Стр Из ТЗ_ПерваяОчередь Цикл  
			
			Если Стр.Количество = 0 Тогда 
				Продолжить;
			КонецЕсли;					  
			
			СписатьИзЯчейки = Мин(Стр.Количество,СтрТоваров.Количество);  
			
			НоваяСтрока = ДокОбъект.Заказано.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,Стр,, "Количество"); 
			НоваяСтрока.Количество = СписатьИзЯчейки;
			СтрТоваров.Количество = СтрТоваров.Количество - СписатьИзЯчейки;  
			
			ТЗЯчейки[Стр.ИндексСтроки].Количество = ТЗЯчейки[Стр.ИндексСтроки].Количество - СписатьИзЯчейки;
			
			Если СтрТоваров.Количество <= 0 Тогда
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
		// теперь списываем с ячеек, товара в которых полностью нам не хватает
		Если СтрТоваров.Количество > 0 Тогда 
			
			Для Каждого Стр Из ТЗ_ВтораяОчередь Цикл  
				
				Если Стр.Количество = 0 Тогда 
					Продолжить;
				КонецЕсли;					  
				
				СписатьИзЯчейки = Мин(Стр.Количество, СтрТоваров.Количество);  
				
				НоваяСтрока = ДокОбъект.Заказано.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Стр,, "Количество"); 
				НоваяСтрока.Количество = СписатьИзЯчейки;
				Стр.Количество = Стр.Количество - СписатьИзЯчейки;
				СтрТоваров.Количество = СтрТоваров.Количество - СписатьИзЯчейки;
				
				ТЗЯчейки[Стр.ИндексСтроки].Количество = ТЗЯчейки[Стр.ИндексСтроки].Количество - СписатьИзЯчейки;
				
				Если СтрТоваров.Количество <= 0 Тогда
					Прервать;
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ДокОбъект.Заказано.Сортировать("Ячейка Убыв");
	
	ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
	//-Кабанов А.В. 22.07.2025 # UT10-5343   
	
КонецПроцедуры

Функция ПроверитьДокументыПоКладовщику(ПромКладовщик) Экспорт  
	//+Кабанов А.В. 22.07.2025 # UT10-5343
	Если Справочники.КатегорииОбъектов.КатегорияОбъектаУстановлена(ПромКладовщик, Справочники.КатегорииОбъектов.РаботаСНесколькимиДокументамиПриМаркировке) Тогда
		Возврат Истина;
	Иначе
		
		ЗапросДокументовПоКладовщику = Новый Запрос;
		ЗапросДокументовПоКладовщику.Текст =
		"ВЫБРАТЬ
		|	МаркировкаТоваровГИСМ.Ссылка
		|ИЗ
		|	Документ.МаркировкаТоваровГИСМ КАК МаркировкаТоваровГИСМ
		|ГДЕ
		|	НЕ МаркировкаТоваровГИСМ.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыМаркировкиТоваров.Завершен)
		|	И МаркировкаТоваровГИСМ.Кладовщик = &Кладовщик
		|	И НЕ МаркировкаТоваровГИСМ.ПометкаУдаления";
		
		ЗапросДокументовПоКладовщику.УстановитьПараметр("Кладовщик", ПромКладовщик);
		
		РезультатЗапросаДокументов = ЗапросДокументовПоКладовщику.Выполнить();
		
		Возврат РезультатЗапросаДокументов.Пустой(); 
		
	КонецЕсли;
	//-Кабанов А.В. 22.07.2025 # UT10-5343  
КонецФункции

Функция ПолучитьУсловиеПоЯчейке(ЗаполнениеИзЯчейкиПеремаркировка) Экспорт
	
	//+Шульман А. 01.10.2025 #UT10-5445
	Возврат ?(ЗаполнениеИзЯчейкиПеремаркировка И Не Константы.ЯчейкаДляПеремаркировки.Получить().Пустая(), "Ячейка = &ЯчейкаДляПеремаркировки", "ИСТИНА");
    //-Шульман А. 01.10.2025 #UT10-5445

КонецФункции // ()
	
Функция ПолучитьПодчиненныйДокументПоМаркировке(ДокМаркировка, ВидДокумента) Экспорт
	
	//+Шульман А. 02.10.2025 #UT10-5445	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ЗаказНаЭмиссиюКодовМаркировкиСУЗ.Ссылка
		|ИЗ
		|	Документ.ЗаказНаЭмиссиюКодовМаркировкиСУЗ КАК ЗаказНаЭмиссиюКодовМаркировкиСУЗ
		|ГДЕ
		|	ЗаказНаЭмиссиюКодовМаркировкиСУЗ.Проведен
		|	И ЗаказНаЭмиссиюКодовМаркировкиСУЗ.Основание = &ДокМаркировка";
	
	Запрос.УстановитьПараметр("ДокМаркировка", ДокМаркировка);   
	
	Если ВидДокумента = "ОтчетОНанесенииКИЗ" Тогда
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ЗаказНаЭмиссиюКодовМаркировкиСУЗ", ВидДокумента);   
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Основание = ", "Основание.Основание = ");   
	
	КонецЕсли;  
	
	РезультатЗапроса = Запрос.Выполнить();  
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	Возврат Выборка.Ссылка;
	//-Шульман А. 02.10.2025 #UT10-5445	

КонецФункции // ()
